app/views/posts/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <div class="note_h_left">
        <% user = User.find(el.user_id)%>