app/views/posts/show.html.erb

        <div class="note_h_left">
          <% user = User.find(@post.user_id)%>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]