app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "posts".* FROM "posts"
---
  def index
    @user =  User.find(7)
    puts("Posts: #{@user.id}")
    @posts = Post.all

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def show
    @user =  User.find(params[:user_id])
      @post = Post.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "fserdfsesefs"], ["content", "sfsfsefsefse"], ["created_at", "2021-04-17 17:03:28.754472"], ["updated_at", "2021-04-17 17:03:28.754472"], ["user_id", 11]]
---
  def create
    @user =  User.find(params[:user_id])
    post_paramsdwaaw = post_params
    post_paramsdwaaw["user_id"] = @user.id
    @post = Post.new(post_paramsdwaaw)
      if @post.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "hrtfhrtftfrfsw"], ["updated_at", "2021-04-17 16:57:23.660181"], ["id", 6]]
---
  def update
    @user =  User.find(params[:user_id])
      @post = Post.find(params[:id])
      if @post.update(post_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 6]]
---
  def destroy
    @user =  User.find(params[:user_id])
      @post = Post.find(params[:id])
      @post.destroy