app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "email", "rol", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
      @user = User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "aasefse"], ["email", "aafsefse"], ["updated_at", "2021-04-19 17:53:02.293213"], ["id", 7]]
---
  def update
      @user = User.find(params[:id])
      if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 14]]
---
  def destroy
      @user = User.find(params[:id])
      puts(" AAAAAAAAAAAAAAAAAAAAAAAAa #{@user.id}, #{@user.username}")
      @user.destroy